In [22]:
import pandas as pd

In [23]:
dict = {'col1' : [1,2,3,4,5],
        'col2' : [42,32,43,25,64],
        'col3' : ['sudhanshu','krish','blah','ineuron','DS'],
        }

In [24]:
df = pd.DataFrame(dict )

In [25]:
df

   col1  col2       col3
0     1    42  sudhanshu
1     2    32      krish
2     3    43       blah
3     4    25    ineuron
4     5    64         DS

In [26]:
df['col4'] = df['col1']**2

In [27]:
df

   col1  col2       col3  col4
0     1    42  sudhanshu     1
1     2    32      krish     4
2     3    43       blah     9
3     4    25    ineuron    16
4     5    64         DS    25

In [28]:
df['col5'] = df['col3'].str[0]

In [29]:
df

   col1  col2       col3  col4 col5
0     1    42  sudhanshu     1    s
1     2    32      krish     4    k
2     3    43       blah     9    b
3     4    25    ineuron    16    i
4     5    64         DS    25    D

In [30]:
def test(x) : 
    if 's' in x :  return 's'
    else : return 'z'

In [31]:
# this checks not for whole string as 's' but any one occurence of 's' in x
def test1(x) : 
    if x=='s' :  return 's'
    else : return 'z'

In [32]:
df['col3_3'] = df['col3'].apply(test)

In [33]:
df

   col1  col2       col3  col4 col5 col3_3
0     1    42  sudhanshu     1    s      s
1     2    32      krish     4    k      s
2     3    43       blah     9    b      z
3     4    25    ineuron    16    i      z
4     5    64         DS    25    D      z

In [34]:
df.drop('col3_3',inplace=True,axis=1)

In [35]:
df

   col1  col2       col3  col4 col5
0     1    42  sudhanshu     1    s
1     2    32      krish     4    k
2     3    43       blah     9    b
3     4    25    ineuron    16    i
4     5    64         DS    25    D

In [36]:
df['col6'] = df['col5'].apply(lambda x : 's' if x == 's' else 'z')

In [37]:
df

   col1  col2       col3  col4 col5 col6
0     1    42  sudhanshu     1    s    s
1     2    32      krish     4    k    z
2     3    43       blah     9    b    z
3     4    25    ineuron    16    i    z
4     5    64         DS    25    D    z

In [38]:
df.drop('col6',inplace=True,axis=1)

In [39]:
df

   col1  col2       col3  col4 col5
0     1    42  sudhanshu     1    s
1     2    32      krish     4    k
2     3    43       blah     9    b
3     4    25    ineuron    16    i
4     5    64         DS    25    D

In [40]:
df['col7'] = df['col3'].apply(len)

In [41]:
df

   col1  col2       col3  col4 col5  col7
0     1    42  sudhanshu     1    s     9
1     2    32      krish     4    k     5
2     3    43       blah     9    b     4
3     4    25    ineuron    16    i     7
4     5    64         DS    25    D     2

In [36]:
import math
df['col8'] = df['col2'].apply(math.log)

In [37]:
df

   col1  col2       col3  col4 col5 col6  col7      col8
0     1    42  sudhanshu     1    s    z     9  3.737670
1     2    32      krish     4    k    z     5  3.465736
2     3    43   somanshu     9    s    z     8  3.761200
3     4    25    ineuron    16    i    z     7  3.218876
4     5    64         DS    25    D    z     2  4.158883

In [42]:
import numpy as np

In [43]:
l = ['som',1,3,4,5]

In [44]:
np.array(l)

array(['som', '1', '3', '4', '5'], dtype='<U11')

In [45]:
type(np.array(l))

numpy.ndarray

In [46]:
# upcasting 
np.array([3,4,5,2.0])

array([3., 4., 5., 2.])

In [48]:
a = np.array([[2,4],[3,6]])

In [50]:
a

array([[2, 4],
       [3, 6]])

In [49]:
a[1]

array([3, 6])

In [51]:
a[1][1]

6

In [55]:
a2 = np.array([1,2,3,4],ndmin=4)

In [56]:
a2

array([[[[1, 2, 3, 4]]]])

In [60]:
a2[0][0][0][0]

1

In [61]:
np.asarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [62]:
np.asanyarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [63]:
np.mat([1,2,3,4,5])

matrix([[1, 2, 3, 4, 5]])

In [64]:
a3 = np.mat([1,2,3,4,5])

In [66]:
# converted matrix to array
np.asarray(a3)

array([[1, 2, 3, 4, 5]])

In [67]:
# did not convert matrix to array
np.asanyarray(a3)

matrix([[1, 2, 3, 4, 5]])

In [70]:
np.fromfunction(lambda i,j: ((i+1)%3)==0 , (3,3) )
# this shows that row wise iterations are done on a column then on another column and so on.

array([[False, False, False],
       [False, False, False],
       [ True,  True,  True]])

In [72]:
np.fromfunction(lambda i,j: i*j , (4,4) )

array([[0., 0., 0., 0.],
       [0., 1., 2., 3.],
       [0., 2., 4., 6.],
       [0., 3., 6., 9.]])

In [73]:
# by default it gives floating point number, however, you can define dtype on your own.
np.fromfunction(lambda i,j: i*j , (4,4),dtype = int )

array([[0, 0, 0, 0],
       [0, 1, 2, 3],
       [0, 2, 4, 6],
       [0, 3, 6, 9]])

In [78]:
np.fromfunction(lambda i,j,z: i*j*z , (3,3,1),dtype = int )
# (3,3,1) -> 3 arrays of 3 X 1(3 rows, 1 column)

array([[[0],
        [0],
        [0]],

       [[0],
        [0],
        [0]],

       [[0],
        [0],
        [0]]])

In [80]:
# only 'i' in array elements
np.fromfunction(lambda i,j,z: i , (3,3,3),dtype = int )

array([[[0, 0, 0],
        [0, 0, 0],
        [0, 0, 0]],

       [[1, 1, 1],
        [1, 1, 1],
        [1, 1, 1]],

       [[2, 2, 2],
        [2, 2, 2],
        [2, 2, 2]]])

In [81]:
# only j in array elements 
np.fromfunction(lambda i,j,z: j, (3,3,3),dtype = int )

array([[[0, 0, 0],
        [1, 1, 1],
        [2, 2, 2]],

       [[0, 0, 0],
        [1, 1, 1],
        [2, 2, 2]],

       [[0, 0, 0],
        [1, 1, 1],
        [2, 2, 2]]])

In [82]:
# (3,3,2)
# (depth,rows,columns)

In [85]:
# You can't visualize this
# but, always read from back
# Here, there is a bundle of 3 arrays of 2 X 2 arrays 
# and there are 4 such bundles
np.fromfunction(lambda i,j,z,p : i*j*z*p,(4,3,2,2),dtype=int)

array([[[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 0]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 1]],

        [[0, 0],
         [0, 2]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 2]],

        [[0, 0],
         [0, 4]]],


       [[[0, 0],
         [0, 0]],

        [[0, 0],
         [0, 3]],

        [[0, 0],
         [0, 6]]]])

In [88]:
a = np.fromfunction(lambda i,j,z : i*j*z,(3,3,2),dtype=int)

In [89]:
a.ndim

3